/*!
****************************************************************************************************
* 文件名称：
*
* 功能描述：
*
* 当前版本：V1.0
*
* 版权声明：All Rights Reserved.
****************************************************************************************************
* 创建记录：L.H.T $$3672 创建文件 2017-10-19
****************************************************************************************************
* 修改记录：
***************************************************************************************************/
#ifndef _CONFIG_
#define _CONFIG_


//-------- <<< Use Configuration Wizard in Context Menu >>> ----------------------------------------
//	<h> Boot模式配置
//		<o> 属性名称: 开启boot		<0x0=> disable
//                              <0x01=> enable
//	  	<i> 属性描述：不开启boot将会直接跳至App运行。
//	  	<i> 开启boot将执行正常boot流程:等待一段时间（此时间用于客户升级代码），然后检查升级标志
//	  	<i> 确定运行缓存区代码还是APP代码。
//	   	<i> 默认参数：enable
				#define CONFIG_BOOT_ENABLE		     	0x01
//		<o> 属性名称: boot启动时间(ms)
//	  	<i> 属性描述：boot启动时间，此时间用于客户启动升级流程。升级完毕自动跳到升级的代码处运行
//	   	<i> 默认参数：1000ms
				#define CONFIG_BOOT_RUN_TIME		    500
//		<o> 属性名称: 是否开启打印字符串<0x0=> disable
//                              <0x01=> enable
//	  	<i> 属性描述：开启将通过通信口打印信息
//	   	<i> 默认参数：enable
				#define CONFIG_BOOT_PRINT_ENABLE		0x01
//		<s> 属性名称: 版本号
//	  	<i> 属性描述：版本信息
//	   	<i> 默认参数："BootLoader V2.0"
				#define CONFIG_BOOT_VERSION				"K66_BootLoader"
//		<o> 属性名称: 是否开启FPGA<0x0=> disable
//                              <0x01=> enable
//	  	<i> 属性描述：开启FPGA升级
//	   	<i> 默认参数：disable
				#define CONFIG_BOOT_FPGA_ENABLE		    0x01													
//	</h>
//	<h> 板级相关配置
// 		<h> 串口设备
// 			<h> 串口0
//	   			<o> 属性名称: 使能		<0x0=> disable
//                              <0x01=> enable
//	  			<i> 属性描述：使能串口
//	   			<i> 默认参数：enable
				#define CONFIG_COM0_ENABLE		     	1
//	   			<o> 属性名称: 波特率		<9600=> 9600
//                              <19200=> 19200
//                              <38400=> 38400
//                              <57600=> 57600
//                              <115200=> 115200
//	  			<i> 属性描述：波特率必须为在9600~115200之间的标准波特率
//	   			<i> 默认参数：115200u
				#define CONFIG_COM0_BARDRATE			115200
//	   			<o> 属性名称: 校验		  <0x0=> none
//                                        <0x03=> evn
//                                        <0x02=> odd
//	  			<i> 属性描述：选择串口校验方式
//	   			<i> 默认参数：无校验
				#define CONFIG_COM0_CHECK			    0x0
//			</h>
// 			<h> 串口1
//	   			<o> 属性名称: 使能		<0x0=> disable
//                              <0x01=> enable
//	  			<i> 属性描述：使能串口
//	   			<i> 默认参数：enable
				#define CONFIG_COM1_ENABLE		     	1
//	   			<o> 属性名称: 波特率		<9600=> 9600
//                              <19200=> 19200
//                              <38400=> 38400
//                              <57600=> 57600
//                              <115200=> 115200
//	  			<i> 属性描述：波特率必须为在9600~115200之间的标准波特率
//	   			<i> 默认参数：115200u
				#define CONFIG_COM1_BARDRATE			115200
//	   			<o> 属性名称: 校验		  <0x0=> none
//                                        <0x03=> evn
//                                        <0x02=> odd
//	  			<i> 属性描述：选择串口校验方式
//	   			<i> 默认参数：无校验
				#define CONFIG_COM1_CHECK			    0x0
//			</h>
// 			<h> 串口2
//	   			<o> 属性名称: 使能		<0x0=> disable
//                              <0x01=> enable
//	  			<i> 属性描述：使能串口
//	   			<i> 默认参数：enable
				#define CONFIG_COM2_ENABLE		     	1
//	   			<o> 属性名称: 波特率		<9600=> 9600
//                              <19200=> 19200
//                              <38400=> 38400
//                              <57600=> 57600
//                              <115200=> 115200
//	  			<i> 属性描述：波特率必须为在9600~115200之间的标准波特率
//	   			<i> 默认参数：115200u
				#define CONFIG_COM2_BARDRATE			115200
//	   			<o> 属性名称: 校验		  <0x0=> none
//                                        <0x03=> evn
//                                        <0x02=> odd
//	  			<i> 属性描述：选择串口校验方式
//	   			<i> 默认参数：无校验
				#define CONFIG_COM2_CHECK			    0x0
//			</h>
// 			<h> 串口3
//	   			<o> 属性名称: 使能		<0x0=> disable
//                              <0x01=> enable
//	  			<i> 属性描述：使能串口
//	   			<i> 默认参数：enable
				#define CONFIG_COM3_ENABLE		     	1
//	   			<o> 属性名称: 波特率		<9600=> 9600
//                              <19200=> 19200
//                              <38400=> 38400
//                              <57600=> 57600
//                              <115200=> 115200
//	  			<i> 属性描述：波特率必须为在9600~115200之间的标准波特率
//	   			<i> 默认参数：115200u
				#define CONFIG_COM3_BARDRATE			115200
//	   			<o> 属性名称: 校验		  <0x0=> none
//                                        <0x03=> evn
//                                        <0x02=> odd
//	  			<i> 属性描述：选择串口校验方式
//	   			<i> 默认参数：无校验
				#define CONFIG_COM3_CHECK			    0x0
//			</h>
// 			<h> 串口4
//	   			<o> 属性名称: 使能		<0x0=> disable
//                              <0x01=> enable
//	  			<i> 属性描述：使能串口
//	   			<i> 默认参数：enable
				#define CONFIG_COM4_ENABLE		     	1
//	   			<o> 属性名称: 波特率		<9600=> 9600
//                              <19200=> 19200
//                              <38400=> 38400
//                              <57600=> 57600
//                              <115200=> 115200
//	  			<i> 属性描述：波特率必须为在9600~115200之间的标准波特率
//	   			<i> 默认参数：115200u
				#define CONFIG_COM4_BARDRATE			115200
//	   			<o> 属性名称: 校验		  <0x0=> none
//                                        <0x03=> evn
//                                        <0x02=> odd
//	  			<i> 属性描述：选择串口校验方式
//	   			<i> 默认参数：无校验
				#define CONFIG_COM4_CHECK			    0x0
//			</h>

//		</h>
// 		<h> CAN设备
// 			<h> CAN0
//	   			<o> 属性名称: 使能		<0x0=> disable
//                              <0x01=> enable
//	  			<i> 属性描述：使能串口
//	   			<i> 默认参数：115200u
				#define CONFIG_CAN0_ENABLE		     	1
//	   			<o> 属性名称: 波特率		<1000000=> 1000K
//                              <500000=> 500K
//                              <200000=> 200K
//                              <100000=>  100K
//                              <50000=> 50K
//	  			<i> 属性描述：波特率 应小于1MHz
//	   			<i> 默认参数：115200u
				#define CONFIG_CAN0_BARDRATE			500000
//	   			<o> 属性名称: ID		
//	  			<i> 属性描述：设置CAN ID
//	   			<i> 默认参数：0x40
				#define CONFIG_CAN0_ID			    	0x1u
//			</h>
// 			<h> CAN1
//	   			<o> 属性名称: 使能		<0x0=> disable
//                              <0x01=> enable
//	  			<i> 属性描述：使能串口
//	   			<i> 默认参数：500K
				#define CONFIG_CAN1_ENABLE		     	1
//	   			<o> 属性名称: 波特率		<1000000=> 1000K
//                              <500000=> 500K
//                              <200000=> 200K
//                              <100000=>  100K
//                              <50000=> 50K
//	  			<i> 属性描述：波特率 应小于1MHz
//	   			<i> 默认参数：500K
				#define CONFIG_CAN1_BARDRATE			500000
//	   			<o> 属性名称: ID		
//	  			<i> 属性描述：设置CAN ID
//	   			<i> 默认参数：0x40
				#define CONFIG_CAN1_ID			    	0x1u
//			</h>
//		</h>
//	</h>
//	<h> FLASH配置
//	   		<o> 属性名称:FLASH页大小<0x0-0x200000>		
//	  		<i> 属性描述：4K
//	   		<i> 默认参数：0x00001000
			#define FLASH_SECTOR_SIZE			0x00001000
//		<h> FLASH地址信息
//	   		<o> 属性名称:Boot 起始地址<0x0-0x200000>		
//	  		<i> 属性描述：boot 代码起始地址
//	   		<i> 默认参数：0x00000000
			#define FLASH_ADD_BOOT			0x00000000
//	   		<o> 属性名称:APP 起始地址<0x0-0x200000>		
//	  		<i> 属性描述：应用代码程序存放区域 默认256K
//	   		<i> 默认参数：0x00020000
			#define FLASH_ADD_APP			0x00020000
//	   		<o> 属性名称:Cache 起始地址<0x0-0x200000>		
//	  		<i> 属性描述:默认缓存大小256K
//	   		<i> 默认参数：0x00060000
			#define FLASH_ADD_CACHE			0x00060000	
//	   		<o> 属性名称:MCU升级标志<0x0-0x200000>		
//	  		<i> 属性描述:默认大小4K
//	   		<i> 默认参数：0x000a0000
			#define FLASH_ADD_FLAG			0x000a0000	
//	   		<o> 属性名称:FPGA升级标志<0x0-0x200000>		
//	  		<i> 属性描述:默认大小4K
//	   		<i> 默认参数：0x000a1000
			#define FLASH_ADD_FPGA_FLAG			0x000a1000	
//	   		<o> 属性名称:存放一些数据<0x0-0x200000>		
//	  		<i> 属性描述:默认大小4K
//	   		<i> 默认参数：0x000a2000
			#define FLASH_ADD_DATA			0x000a2000		
//	   		<o> 属性名称:FPGA起始地址<0x0-0x200000>		
//	  		<i> 属性描述:默认大小1M,没有FPGA代码不用理会
//	   		<i> 默认参数：0x00100000
			#define FLASH_ADD_FPGA			0x00100000	
//		</h> FLASH地址信息	
//		<h> FLASH占用大小信息
//	   		<o> 属性名称:boot大小<0x0-0x200000>		
//	  		<i> 属性描述：128K
//	   		<i> 默认参数：0x00020000
			#define FLASH_SIZE_BOOT			0x00020000
//	   		<o> 属性名称:App大小<0x0-0x200000>		
//	  		<i> 属性描述：256K
//	   		<i> 默认参数：0x00040000
			#define FLASH_SIZE_APP			0x00040000
//	   		<o> 属性名称:Cache大小<0x0-0x200000>		
//	  		<i> 属性描述：256K
//	   		<i> 默认参数：0x00040000
			#define FLASH_SIZE_CACHE		0x00040000
//	   		<o> 属性名称:标志大小<0x0-0x200000>		
//	  		<i> 属性描述：标志存放一般直接占一页
//	   		<i> 默认参数：0x00001000
			#define FLASH_SIZE_FLAG		0x00001000
//	   		<o> 属性名称:FPGA大小<0x0-0x200000>		
//	  		<i> 属性描述：1M
//	   		<i> 默认参数：0x00100000
			#define FLASH_SIZE_FPGA		0x00100000			
//		</h> FLASH占用大小信息
//	</h> 

#endif


